# Read primitive packages first
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_assert.sv
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_util_pkg.sv
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_mubi_pkg.sv
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_ram_1p_pkg.sv
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_secded_pkg.sv

# Read primitive modules
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_lfsr.sv
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_secded_inv_39_32_dec.sv
read_verilog -sv -D SYNTHESIS ibex/vendor/lowrisc_ip/ip/prim/rtl/prim_secded_inv_39_32_enc.sv

# Read Ibex package
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_pkg.sv

# Read Ibex core modules
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_alu.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_branch_predict.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_compressed_decoder.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_controller.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_counter.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_cs_registers.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_csr.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_decoder.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_dummy_instr.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_ex_block.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_fetch_fifo.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_id_stage.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_if_stage.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_load_store_unit.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_multdiv_fast.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_multdiv_slow.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_pmp.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_prefetch_buffer.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_register_file_ff.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_wb_stage.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_core.sv
read_verilog -sv -D SYNTHESIS ibex/rtl/ibex_top.sv

# Read our wrapper files
read_verilog -D SYNTHESIS cve2_soc.v
read_verilog -D SYNTHESIS cve2_top.v

# Synthesize
hierarchy -check -top top
synth_ecp5 -top top -json cve2_top.json
